src/main/resources/templates/eliminarProducto.vm

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:tem="http://tempuri.org/" xmlns:ns="http://schemas.datacontract.org/2004/07/">
   <soapenv:Header/>
   <soapenv:Body>
      <tem:eliminarProducto>
         <!--Optional:-->
         <tem:ObjProResultado>
            <!--Optional:-->
            <ns:CodigoProducto>$!{headers.req.codigoProducto}</ns:CodigoProducto>
            <!--Optional:-->
            <ns:EstadoProducto>0</ns:EstadoProducto>
            <!--Optional:-->
            <ns:MensajeEstado>0</ns:MensajeEstado>
         </tem:ObjProResultado>
      </tem:eliminarProducto>
   </soapenv:Body>
</soapenv:Envelope>